01-Monday/03-Video-Games/app/controllers/api/tournaments_controller.rb

  def index
    tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

  def create
    tournament = Tournament.create(tournament_params)
---
INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "yolo"], ["created_at", "2015-09-21 15:51:03.064172"], ["updated_at", "2015-09-21 15:51:03.064172"]]

  def destroy
    tournament = Tournament.find_by(id: params[:id])
    tournament.destroy
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT 1  [["id", 15]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = $1  [["id", 15]]