03-Wednesday/02-Devise/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    skip_authorization
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "completed", "user_id", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asdfsa"], ["completed", "t"], ["user_id", 7], ["due_date", "2015-09-23 14:43:00.000000"], ["created_at", "2015-09-23 14:43:21.185510"], ["updated_at", "2015-09-23 14:43:21.185510"]]

  def update
    @task = Task.find(params[:id])
    authorize @task
    respond_to do |format|
      if @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "tasks" SET "due_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["due_date", "2015-09-23 13:15:00.000000"], ["updated_at", "2015-09-23 14:42:59.497551"], ["id", 10]]

  def destroy
    @task = Task.find(params[:id])
    authorize @task
    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 9]]