03-Wednesday/02-Devise/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hjkl"], ["email", "fbvn@hj.com"], ["created_at", "2015-09-23 12:40:48.722155"], ["updated_at", "2015-09-23 12:40:48.722155"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save